app/controllers/home_controller.rb

SELECT "event_types".* FROM "event_types"
SELECT "events".* FROM "events"
---
  def index
  	@categorias= EventCategory.all
  	@tipo_eventos= EventType.all
  	@eventos = Event.where(nil)
  	@eventos= Event.by_tipo(params[:param1]) if params[:param1].present?