app/controllers/profile_controller.rb

SELECT "events".* FROM "events"
---
  def index
	 @eventos = Event.all